x=str(input("ใส่เลขของท่าน : "))
checker={"รางวัลที่1" :["046750"],"รางวัลที่2" : ["688916","774867","222907","903009","607877"]
,"รางวัลข้างเคียง" : ["046749","046751"],"เลขหน้า3ตัว" : ["666","421"],"เลขหลัง3ตัว" : ["160","355"]
,"เลขท้าย2ตัว" : ["23"]}
z=False
for i in checker:
    for j in checker[i]:
        if x==j:
            print("คุณได้ "+(i))
            z=True
        elif x[0:3]==j:
            print("คุณได้" +(i))
            z=True
        elif x[4:7]==j:
            print("คุณได้" +(i))
            z=True
        elif x[5:7]==j:
            print("คุณได้" +(i))
            z=True
if z==False:
    print("คุณโดนหวยกิน")